# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionBindingMap..::..Contains Method
DefinitionBindingMap Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	Definition key
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	key As Definition _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	Definition^ key
)
```

# ### Parameters
key
    Type: Autodesk.Revit.DB..::..Definition
# See Also
DefinitionBindingMap Class
Autodesk.Revit.DB Namespace